Repository: X-rus/xNet
Catalog: Resources-*.resx
Languages: ru_ru, zh_cn

# ArgumentException_HttpRequest_SetNotAvailableHeader
source: Value of '{0}' set not available header
ru_ru: Значение заголовка '{0}' можно задать только с помощью специального свойства.
zh_cn: header的值“{0}”只能在特殊属性的帮助下设置的。

# ArgumentException_MultiThreading_BegIndexRangeMoreEndIndex
source: Begin Index range more end index
ru_ru: Начальный индекс диапазона не может быть больше конечного индекса.
zh_cn: 索引的初始范围不能超过结束索引值。

# ArgumentException_OnlyAbsoluteUri
source: Acceptable use only the absolute URI.
ru_ru: Допустимо использовать только абсолютный URI.
zh_cn: 只接受绝对URI。

# ArgumentOutOfRangeException_CanNotBeLess
source: The value can not be less {0}.
ru_ru: Значение параметра не может быть меньше {0}.
zh_cn: 该值不能小于{0}。

# ArgumentOutOfRangeException_CanNotBeLessOrGreater
source: The value can not be less than {0} or {1} longer.
ru_ru: Значение параметра не может быть меньше {0} или больше {1}.
zh_cn: 该值不能小于{0}或大于{1}。

# ArgumentOutOfRangeException_StringLengthCanNotBeMore
source: String length must not be more than {0} characters.
ru_ru: Длина строки не должна быть больше {0} символов.
zh_cn: 字符串的长度不得超过{0}个字符。

# FormatException_ProxyClient_WrongPort
source: Invalid port specified.
ru_ru: Неверно задан порт.
zh_cn: 无效的端口。

# HttpException_ClientError
source: The error on the client side. Status code: {0}
ru_ru: Ошибка на стороне клиента. Код состояния: {0}
zh_cn: 错误发生在客户端。状态代码：{0}

# HttpException_ConnectTimeout
source: It turned out wait for a connection to the HTTP-server '{0}'.
ru_ru: Вышло время ожидания подключения к HTTP-серверу '{0}'.
zh_cn: 连接服务器“{0}”超时。

# HttpException_FailedConnect
source: Unable to connect to the HTTP-server '{0}'.
ru_ru: Не удалось соединиться с HTTP-сервером '{0}'.
zh_cn: 无法连接到HTTP服务器“{0}”。

# HttpException_FailedGetHostAddresses
source: Failed to get the host IP-address '{0}'.
ru_ru: Не удалось получить IP-адреса узла '{0}'.
zh_cn: 无法获得主机“{0}”的IP地址。

# HttpException_FailedReceiveMessageBody
source: Could not recieve the message body of the response HTTP-server '{0}'.
ru_ru: Не удалось загрузить тело сообщения ответа от HTTP-сервера '{0}'.
zh_cn: 无法加载HTTP服务器“{0}”的响应消息正文。

# HttpException_FailedReceiveResponse
source: Failed to recieve the response from the HTTP-server '{0}'.
ru_ru: Не удалось загрузить ответ от HTTP-сервера '{0}'.
zh_cn: 无法从HTTP服务器“{0}”加载响应。

# HttpException_FailedSendRequest
source: Failed to send HTTP-request to the server '{0}'.
ru_ru: Не удалось отправить запрос HTTP-серверу '{0}'.
zh_cn: 未能发送HTTP请求到服务器“{0}”。

# HttpException_FailedSslConnect
source: Unable to establish SSL-connection with HTTP-server '{0}'.
ru_ru: Не удалось установить SSL-соединение с HTTP-сервером '{0}'.
zh_cn: 无法建立与HTTP服务器“{0}”的SSL连接。

# HttpException_WaitDataTimeout
source: It turned out the wait time data from the HTTP-server '{0}'.
ru_ru: Вышло время ожидания данных от HTTP-сервера '{0}'.
zh_cn: 等待HTTP服务器“{0}”返回数据超时。

# HttpException_ReceivedEmptyResponse
source: Received empty response from the HTTP-server '{0}'.
ru_ru: Получен пустой ответ от HTTP-сервера '{0}'.
zh_cn: 从HTTP服务器“{0}”收到空响应。

# HttpException_SeverError
source: The error on the server side. Status code: {0}
ru_ru: Ошибка на стороне сервера. Код состояния: {0}
zh_cn: 错误发生在服务器端。状态代码：{0}

# HttpException_WrongCookie
source: Received invalid cookies '{0}' from the HTTP-server '{1}'.
ru_ru: Получен неверный кукис '{0}' от HTTP-сервера '{1}'.
zh_cn: 从HTTP服务器“{1}”接收到无效的cookie“{0}”。

# HttpException_WrongHeader
source: Received invalid header "{0} 'from the HTTP-server' {1} '.
ru_ru: Получен неверный заголовок '{0}' от HTTP-сервера '{1}'.
zh_cn: 从HTTP服务器“{1}”收到的无效报头“{0}”。

# InvalidOperationException_HttpResponse_HasError
source: Unable to perform the method, because an error occurred while receiving a response.
ru_ru: Невозможно выполнить метод, так как при получении ответа произошла ошибка.
zh_cn: 方法无法执行，因为在接收响应时发生错误。

# InvalidOperationException_NotSupportedEncodingFormat
source: Received an unsupported encoding format: {0}
ru_ru: Получен неподдерживаемый формат кодирования: {0}
zh_cn: 收到不支持的编码格式：{0}

# InvalidOperationException_ProxyClient_WrongHost
source: The host may be uncertain or have zero length.
ru_ru: Хост не может быть неопределённым или иметь нулевую длину.
zh_cn: 主机可能不明确的或具有零长度。

# InvalidOperationException_ProxyClient_WrongPassword
source: The password can not be more than 255 characters.
ru_ru: Длина пароля не может быть больше 255 символов.
zh_cn: 密码不能超过255个字符。

# InvalidOperationException_ProxyClient_WrongPort
source: The port can not be less than 1 or greater than 65535.
ru_ru: Порт не может быть меньше 1 или больше 65535.
zh_cn: 端口不能小于1或大于65535。

# InvalidOperationException_ProxyClient_WrongUsername
source: User name can not be more than 255 characters.
ru_ru: Длина имени пользователя не может быть больше 255 символов.
zh_cn: 用户名不能超过255个字符。

# ProxyException_CommandError
source: {0} The proxy server '{1}'.
ru_ru: {0} Прокси-сервер '{1}'.
zh_cn: {0}的代理服务器“{1}”。

# ProxyException_ConnectTimeout
source: It turned out the wait time to connect to the proxy server '{0}'.
ru_ru: Вышло время ожидания подключения к прокси-серверу '{0}'.
zh_cn: 连接到代理服务器“{0}”超时。

# ProxyException_Error
source: An error occurred while working with the proxy server '{0}'.
ru_ru: Произошла ошибка при работе с прокси-сервером '{0}'.
zh_cn: 使用代理服务器“{0}”时发生错误。

# ProxyException_FailedConnect
source: Unable to connect to the proxy server '{0}'.
ru_ru: Не удалось соединиться с прокси-сервером '{0}'.
zh_cn: 无法连接到代理服务器“{0}”。

# ProxyException_FailedGetHostAddresses
source: Failed to get the host IP-address '{0}'.
ru_ru: Не удалось получить IP-адреса узла '{0}'.
zh_cn: 无法获得主机的IP地址“{0}”。

# ProxyException_NotSupportedAddressType
source: The host '{0}' type '{1}' does not support the type Address. The following types: InterNetwork and InterNetworkV6. The proxy server '{2}'.
ru_ru: Хост '{0}' типа '{1}' не поддерживает используемый тип адресса. Поддерживаются следующие типы: InterNetwork и InterNetworkV6. Прокси-сервер '{2}'.
zh_cn: 主机“{0}”类型“{1}”不支持以下几种类型：InterNetwork和InterNetworkV6。代理服务器“{2}”。

# ProxyException_ReceivedEmptyResponse
source: Received empty response from the proxy server '{0}'.
ru_ru: Получен пустой ответ от прокси-сервера '{0}'.
zh_cn: 从代理服务器“{0}”收到空响应。

# ProxyException_ReceivedWrongResponse
source: Received an invalid response from the proxy server '{0}'.
ru_ru: Получен ошибочный ответ от прокси-сервера '{0}'.
zh_cn: 来自代理服务器“{0}”的响应无效。

# ProxyException_ReceivedWrongStatusCode
source: Received invalid status code '{0}' on '{1}' proxy.
ru_ru: Получен неверный код статуса '{0}' от прокси-сервера '{1}'.
zh_cn: 在“{1}”代理服务器中收到无效的状态代码“{0}”。

# ProxyException_Socks5_FailedAuthOn
source: Failed to authenticate with the proxy server '{0}'.
ru_ru: Не удалось выполнить аутентификацию на прокси-сервере '{0}'.
zh_cn: 无法与代理服务器“{0}”进行身份验证。

# Socks4_CommandReplyRequestRejectedCannotConnectToIdentd
source: The request failed, because things are not running identd (or not available from the server).
ru_ru: Запрос не удался, потому-что не запущен identd (или не доступен с сервера).
zh_cn: 请求失败，因为程序没有正确运行（或无法从服务器返回数据）。

# Socks4_CommandReplyRequestRejectedDifferentIdentd
source: The request failed because client's identd could not confirm the user ID in the query.
ru_ru: Запрос не удался, поскольку клиентский identd не может подтвердить идентификатор пользователя в запросе.
zh_cn: 请求失败，因为在查询中客户无法确认用户ID。

# Socks4_CommandReplyRequestRejectedOrFailed
source: Query rejected or erroneous.
ru_ru: Запрос отклонён или ошибочен.
zh_cn: 查询被拒绝或错误。

# Socks5_AuthMethodReplyNoAcceptableMethods
source: The proposed authentication methods are supported.
ru_ru: Предложенные методы аутентификации не поддерживаются.
zh_cn: 支持所提出的验证方法。

# Socks5_CommandReplyAddressTypeNotSupported
source: Address type not supported.
ru_ru: Тип адреса не поддерживается.
zh_cn: 不支持的地址类型。

# Socks5_CommandReplyCommandNotSupported
source: The command is not supported or protocol error.
ru_ru: Команда не поддерживается, либо ошибка протокола.
zh_cn: 该命令不支持或协议错误。

# Socks5_CommandReplyConnectionNotAllowedByRuleset
source: Connecting a set of rules is prohibited.
ru_ru: Соединение запрещено набором правил.
zh_cn: 连接的一组规则被禁止。

# Socks5_CommandReplyConnectionRefused
source: Connection refused.
ru_ru: Отказ в соединении.
zh_cn: 连接被拒绝。

# Socks5_CommandReplyGeneralSocksServerFailure
source: Error SOCKS-server.
ru_ru: Ошибка SOCKS-сервера.
zh_cn: 错误的SOCKS服务器。

# Socks5_CommandReplyHostUnreachable
source: Host unreachable.
ru_ru: Хост недоступен.
zh_cn: 主机无法访问。

# Socks5_CommandReplyNetworkUnreachable
source: The network is not available.
ru_ru: Сеть недоступна.
zh_cn: 网络不可用。

# Socks5_CommandReplyTTLExpired
source: Expired TTL.
ru_ru: Истёк TTL.
zh_cn: TTL过期。

# Socks_UnknownError
source: Unknown error.
ru_ru: Неизвестная ошибка.
zh_cn: 未知错误。

# ArgumentException_EmptyString
source: Value has not been empty string
ru_ru: Значение параметра не может быть строкой нулевой длины.
zh_cn: 该值不能为空。

# ArgumentOutOfRangeException_StringHelper_MoreLengthString
source: The starting position can not be more than the length of the string.
ru_ru: Начальная позиция не может быть больше длины строки.
zh_cn: 起始位置不能超过字符串的长度。

# DirectoryNotFoundException_DirectoryNotFound
source: he path points to a nonexistent directory {0}.
ru_ru: Путь указывает на несуществующую директорию {0}.
zh_cn: 目录{0}不存在。

# HttpException_Default
source: An error when handling HTTP protocol.
ru_ru: Произошла ошибка при работе с HTTP-протоколом.
zh_cn: 与HTTP报文工作时发生错误。

# NetException_Default
source: An error occurred while working with the network.
ru_ru: Произошла ошибка при работе с сетью.
zh_cn: 网络发生错误。

# ProxyException_Default
source: An error occurred while working with the proxy.
ru_ru: Произошла ошибка при работе с прокси.
zh_cn: 代理发生错误。

# HttpException_ReceivedWrongResponse
source: Received an invalid response from the HTTP-server '{0}'.
ru_ru: Получен ошибочный ответ от HTTP-сервера '{0}'.
zh_cn: 接收到来自HTTP服务器“{0}”的无效响应。

# ProxyException_WaitDataTimeout
source: It turned out the wait time data from the proxy server '{0}'.
ru_ru: Вышло время ожидания данных от прокси-сервера '{0}'.
zh_cn: 等待代理服务器“{0}”返回数据超时。

# HttpException_LimitRedirections
source: Have exceeded the maximum number of consecutive redirects.
ru_ru: Превышено допустимое количество последовательных переадресаций.
zh_cn: 已经超过连续重定向的最大数量。

# HttpException_WrongChunkedBlockLength
source: Received invalid data block size when using Chunked: {0}
ru_ru: Получен неверный размер блока данных при использовании Chunked: {0}
zh_cn: 当采用分块时接收到无效的数据块大小：{0}

# InvalidOperationException_ChainProxyClient_NotProxies
source: Do not set any proxy for the chain.
ru_ru: Не задано ни одного прокси-сервера для цепочки.
zh_cn: 不要为通路设置任何代理。

# ArgumentOutOfRangeException_CanNotBeGreater
source: The value can not be more than {0}.
ru_ru: Значение параметра не может быть больше {0}.
zh_cn: 该值不能超过{0}。

# ArgumentException_CanNotReadOrSeek
source: Thread can not read or seek
ru_ru: Поток не поддерживает чтение или перемещение позиции.
zh_cn: 流不支持读取或移动位置。

# ArgumentException_WrongPath
source: The path is an empty string, contains only white space, or contains invalid characters.
ru_ru: Путь является пустой строкой, содержит только пробелы или содержит недопустимые символы.
zh_cn: 路径是一个空字符串，仅包含空格，或包含无效字符。
